Tekla Open API Reference for Tekla Structures 2025
RebarCranking.CrankSideEnum Enumeration
 The crank side.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CrankSideEnum
Public Enumeration CrankSideEnum
Members
Member name | Value | Description
CRANK_LEFT | 0 |  Crank left.
CRANK_RIGHT | 1 |  Crank right.
See Also
Reference
Tekla.Structures.Model Namespace